# Pandas

Data manipulation and analysis.

In [8]:
import pandas as pd
#create a database (from a dictionary)
#creating key-value pairs
dictionary = {"Restaurant":["HABITAT COFFEE SHOP","REILLY'S"],
              "Location":["Milan","Los Angeles"]}

print(dictionary)

{'Restaurant': ['HABITAT COFFEE SHOP', "REILLY'S"], 'Location': ['Milan', 'Los Angeles']}

### DataFrame
Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns)

In [9]:
ranrest = pd.DataFrame(dictionary)

In [10]:
ranrest

            Restaurant     Location
0  HABITAT COFFEE SHOP        Milan
1             REILLY'S  Los Angeles

In [11]:
ranrest.index = ["HCS","RS"]
ranrest

              Restaurant     Location
HCS  HABITAT COFFEE SHOP        Milan
RS              REILLY'S  Los Angeles

In [12]:
#not efficient!
#build importing from csv!

## Importing a database

In [15]:
import pandas as pd
df = pd.read_csv("randomrestaurants.csv", sep = ";",index_col = 0) #try to set: index_col = 0

#filepath_or_buffer : str, path object or file-like object
#   Any valid string path is acceptable. The string could be a URL.
#
#sep : str, default ‘,’
#   Delimiter to use.
#
#delimiter : str, default None
#   Alias for sep.
#
#header : int, list of int, default ‘infer’
#   Row number(s) to use as the column name
#   Default behavior is to infer the column names: 
#
#names : array-like, optional
#   List of column names to use.
#
#index_col : int, str, sequence of int / str, or False, default None
#   Column(s) to use as the row labels of the DataFrame

In [16]:
df

              Restaurant     Location  Score
HCS  HABITAT COFFEE SHOP        Milan     95
RS              REILLY'S  Los Angeles     91
SC        STREET CHURROS     New York     90
RGC  RIO GENTLEMANS CLUB         Rome     96
LPQ    LE PAIN QUOTIDIEN       Berlin     89
TEP    TRINITI ECHO PARK       Madrid     99
MMM  MARCE'S MINI MARKET    Cape Town     93
P                 POLLEN       Ottawa     94
TSG       THE SPOT GRILL      Toronto     97

In [18]:
#print(help(pd.read_csv))

In [20]:
df.head(2)

              Restaurant     Location  Score
HCS  HABITAT COFFEE SHOP        Milan     95
RS              REILLY'S  Los Angeles     91

In [21]:
df.sample(5)

              Restaurant     Location  Score
MMM  MARCE'S MINI MARKET    Cape Town     93
LPQ    LE PAIN QUOTIDIEN       Berlin     89
SC        STREET CHURROS     New York     90
RS              REILLY'S  Los Angeles     91
TEP    TRINITI ECHO PARK       Madrid     99

In [23]:
#a further example of importing a dataset
import pandas as pd
df2 = pd.read_csv("glass.csv")
#try to set: index_col=0
df2.head(2)

'''
RI: refractive index
Na: Sodium (unit measurement: weight percent in corresponding oxide, as are attributes 4-10)
Mg: Magnesium
Al: Aluminum
Si: Silicon
K: Potassium
Ca: Calcium
Ba: Barium
Fe: Iron
Type of glass: (class attribute) 
'''

df2.head(10)

        RI     Na    Mg    Al     Si     K    Ca   Ba    Fe  Type
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.00     1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.00     1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.00     1
3  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.00     1
4  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.00     1
5  1.51596  12.79  3.61  1.62  72.97  0.64  8.07  0.0  0.26     1
6  1.51743  13.30  3.60  1.14  73.09  0.58  8.17  0.0  0.00     1
7  1.51756  13.15  3.61  1.05  73.24  0.57  8.24  0.0  0.00     1
8  1.51918  14.04  3.58  1.37  72.08  0.56  8.30  0.0  0.00     1
9  1.51755  13.00  3.60  1.36  72.99  0.57  8.40  0.0  0.11     1

## Index and select data

three options:
1. using square brackets
2. loc
3. iloc

In [24]:
#square brackets
import pandas as pd
restaurants = pd.read_csv("randomrestaurants.csv", sep = ";",index_col=0)

restaurants

              Restaurant     Location  Score
HCS  HABITAT COFFEE SHOP        Milan     95
RS              REILLY'S  Los Angeles     91
SC        STREET CHURROS     New York     90
RGC  RIO GENTLEMANS CLUB         Rome     96
LPQ    LE PAIN QUOTIDIEN       Berlin     89
TEP    TRINITI ECHO PARK       Madrid     99
MMM  MARCE'S MINI MARKET    Cape Town     93
P                 POLLEN       Ottawa     94
TSG       THE SPOT GRILL      Toronto     97

In [29]:
restaurants[["Location"]] #panda series (1d labelled array)
type(restaurants[["Location"]])

pandas.core.frame.DataFrame

In [30]:
restaurants[["Location","Score"]]# data frame
#type(restaurants[["Location"]])

        Location  Score
HCS        Milan     95
RS   Los Angeles     91
SC      New York     90
RGC         Rome     96
LPQ       Berlin     89
TEP       Madrid     99
MMM    Cape Town     93
P         Ottawa     94
TSG      Toronto     97

In [ ]:
restaurants[["Location","Score"]] #select columns

In [31]:
#select rows
restaurants[1:4] # three rows in position [1,2,3]

              Restaurant     Location  Score
RS              REILLY'S  Los Angeles     91
SC        STREET CHURROS     New York     90
RGC  RIO GENTLEMANS CLUB         Rome     96

In [32]:
#WHAT IF i want to select columns and rows as 2D numpy array

#you can use:
#1) loc (based on labels)
#2) iloc (position based)

restaurants.loc["RS"]#as pandas series

Restaurant       REILLY'S
Location      Los Angeles
Score                  91
Name: RS, dtype: object

In [33]:
restaurants.loc[["RS"]]

   Restaurant     Location  Score
RS   REILLY'S  Los Angeles     91

In [34]:
restaurants.loc[["HCS","RS","LPQ"]]

              Restaurant     Location  Score
HCS  HABITAT COFFEE SHOP        Milan     95
RS              REILLY'S  Los Angeles     91
LPQ    LE PAIN QUOTIDIEN       Berlin     89

In [35]:
#extend selecting columns
restaurants.loc[["HCS","RS","LPQ"],["Location","Score"]]

        Location  Score
HCS        Milan     95
RS   Los Angeles     91
LPQ       Berlin     89

In [36]:
restaurants.loc[:,["Location","Score"]] #all rows

        Location  Score
HCS        Milan     95
RS   Los Angeles     91
SC      New York     90
RGC         Rome     96
LPQ       Berlin     89
TEP       Madrid     99
MMM    Cape Town     93
P         Ottawa     94
TSG      Toronto     97

In [37]:
#iloc based on positions
restaurants.iloc[[1]]

   Restaurant     Location  Score
RS   REILLY'S  Los Angeles     91

In [38]:
restaurants.iloc[[1,2,3]]

              Restaurant     Location  Score
RS              REILLY'S  Los Angeles     91
SC        STREET CHURROS     New York     90
RGC  RIO GENTLEMANS CLUB         Rome     96

In [39]:
restaurants.iloc[[1,2,3],[1,2]]

        Location  Score
RS   Los Angeles     91
SC      New York     90
RGC         Rome     96

In [40]:
restaurants.iloc[:,[1,2]]

        Location  Score
HCS        Milan     95
RS   Los Angeles     91
SC      New York     90
RGC         Rome     96
LPQ       Berlin     89
TEP       Madrid     99
MMM    Cape Town     93
P         Ottawa     94
TSG      Toronto     97

In [41]:
restaurants.iloc[:5,[1,2]]

        Location  Score
HCS        Milan     95
RS   Los Angeles     91
SC      New York     90
RGC         Rome     96
LPQ       Berlin     89

In [ ]:
#IMPORTING as NUMPY (only with numerical datasets)
import numpy as np
filename = "glass.csv"
data = np.loadtxt(filename, delimiter=",", skiprows=1)#usecols=[0,2]
data

## Looping on DataFrames

In [ ]:
restaurants

In [ ]:
restaurants

In [42]:
for i in restaurants:
    print(i) #!!! just the columns names

Restaurant
Location
Score

In [43]:
for label, row in restaurants.iterrows():
    print(label,":",row)

HCS : Restaurant    HABITAT COFFEE SHOP
Location                    Milan
Score                          95
Name: HCS, dtype: object
RS : Restaurant       REILLY'S
Location      Los Angeles
Score                  91
Name: RS, dtype: object
SC : Restaurant    STREET CHURROS
Location            New York
Score                     90
Name: SC, dtype: object
RGC : Restaurant    RIO GENTLEMANS CLUB
Location                     Rome
Score                          96
Name: RGC, dtype: object
LPQ : Restaurant    LE PAIN QUOTIDIEN
Location                 Berlin
Score                        89
Name: LPQ, dtype: object
TEP : Restaurant    TRINITI ECHO PARK
Location                 Madrid
Score                        99
Name: TEP, dtype: object
MMM : Restaurant    MARCE'S MINI MARKET
Location                Cape Town
Score                          93
Name: MMM, dtype: object
P : Restaurant    POLLEN
Location      Ottawa
Score             94
Name: P, dtype: object
TSG : Restaurant    THE SPOT GRILL
Location             Toronto
Score                     97
Name: TSG, dtype: object

In [ ]:
#if I just want the ID : the  full name of the restaurant
for label, row in restaurants.iterrows():
    print(label+": "+row["Restaurant"])#+" "+row[("Score")])

In [44]:
#if i want to add a column while iterating
for label, row in restaurants.iterrows():
    restaurants.loc[label,"name_len"] = int(len(row["Restaurant"]))

restaurants

              Restaurant     Location  Score  name_len
HCS  HABITAT COFFEE SHOP        Milan     95      19.0
RS              REILLY'S  Los Angeles     91       8.0
SC        STREET CHURROS     New York     90      14.0
RGC  RIO GENTLEMANS CLUB         Rome     96      19.0
LPQ    LE PAIN QUOTIDIEN       Berlin     89      17.0
TEP    TRINITI ECHO PARK       Madrid     99      17.0
MMM  MARCE'S MINI MARKET    Cape Town     93      19.0
P                 POLLEN       Ottawa     94       6.0
TSG       THE SPOT GRILL      Toronto     97      14.0

In [45]:
#or use a more efficient apply **instead of a for loop**
restaurants["name_len2"] = restaurants["Restaurant"].apply(len)

restaurants

              Restaurant     Location  Score  name_len  name_len2
HCS  HABITAT COFFEE SHOP        Milan     95      19.0         19
RS              REILLY'S  Los Angeles     91       8.0          8
SC        STREET CHURROS     New York     90      14.0         14
RGC  RIO GENTLEMANS CLUB         Rome     96      19.0         19
LPQ    LE PAIN QUOTIDIEN       Berlin     89      17.0         17
TEP    TRINITI ECHO PARK       Madrid     99      17.0         17
MMM  MARCE'S MINI MARKET    Cape Town     93      19.0         19
P                 POLLEN       Ottawa     94       6.0          6
TSG       THE SPOT GRILL      Toronto     97      14.0         14

In [46]:
#using a custom function


restaurants["class"] = restaurants["Score"].apply(lambda x: "A" if (x>95) else "B")

restaurants

              Restaurant     Location  Score  name_len  name_len2 class
HCS  HABITAT COFFEE SHOP        Milan     95      19.0         19     B
RS              REILLY'S  Los Angeles     91       8.0          8     B
SC        STREET CHURROS     New York     90      14.0         14     B
RGC  RIO GENTLEMANS CLUB         Rome     96      19.0         19     A
LPQ    LE PAIN QUOTIDIEN       Berlin     89      17.0         17     B
TEP    TRINITI ECHO PARK       Madrid     99      17.0         17     A
MMM  MARCE'S MINI MARKET    Cape Town     93      19.0         19     B
P                 POLLEN       Ottawa     94       6.0          6     B
TSG       THE SPOT GRILL      Toronto     97      14.0         14     A

In [51]:
restaurants["ratio"]= restaurants["Score"]/restaurants["Score+1"]
restaurants

,Restaurant,Location,Score,name_len,name_len2,class,Score+1,ratio
HCS,HABITAT COFFEE SHOP,Milan,95,19.0,19,B,47.5,2.0
RS,REILLY'S,Los Angeles,91,8.0,8,B,45.5,2.0
SC,STREET CHURROS,New York,90,14.0,14,B,45.0,2.0
RGC,RIO GENTLEMANS CLUB,Rome,96,19.0,19,A,48.0,2.0
LPQ,LE PAIN QUOTIDIEN,Berlin,89,17.0,17,B,44.5,2.0
TEP,TRINITI ECHO PARK,Madrid,99,17.0,17,A,49.5,2.0
MMM,MARCE'S MINI MARKET,Cape Town,93,19.0,19,B,46.5,2.0
P,POLLEN,Ottawa,94,6.0,6,B,47.0,2.0
TSG,THE SPOT GRILL,Toronto,97,14.0,14,A,48.5,2.0

## MERGING

In [52]:
# First Dataset
restaurants = pd.read_csv("randomrestaurants.csv", sep = ";",index_col=0)
restaurants

              Restaurant     Location  Score
HCS  HABITAT COFFEE SHOP        Milan     95
RS              REILLY'S  Los Angeles     91
SC        STREET CHURROS     New York     90
RGC  RIO GENTLEMANS CLUB         Rome     96
LPQ    LE PAIN QUOTIDIEN       Berlin     89
TEP    TRINITI ECHO PARK       Madrid     99
MMM  MARCE'S MINI MARKET    Cape Town     93
P                 POLLEN       Ottawa     94
TSG       THE SPOT GRILL      Toronto     97

In [53]:
# Second Dataset
restaurants2 = pd.read_csv("randomrestaurants_2.csv", sep = ";",index_col=0) # Load a different source
restaurants2

              Restaurant  Patent
HCS  HABITAT COFFEE SHOP   62728
RS              REILLY'S   73839
STC       STREET CHURROS    8888
RT           RATATOUILLE    5567
FF         THE GENTLEMAN     555

In [54]:
#  We merge the two data frames by common index
pd.merge(restaurants,restaurants2 ,left_index=True,right_index=True)

            Restaurant_x     Location  Score         Restaurant_y  Patent
HCS  HABITAT COFFEE SHOP        Milan     95  HABITAT COFFEE SHOP   62728
RS              REILLY'S  Los Angeles     91             REILLY'S   73839

In [55]:
 # ..but we can do it by a different column
pd.merge(restaurants,restaurants2,left_on="Restaurant",right_on="Restaurant" )

            Restaurant     Location  Score  Patent
0  HABITAT COFFEE SHOP        Milan     95   62728
1             REILLY'S  Los Angeles     91   73839
2       STREET CHURROS     New York     90    8888

In [ ]:
 # ..or multiple columns
pd.merge(restaurants,restaurants2,left_index=True, right_index=True, left_on=["Restaurant"],right_on=["Restaurant"] )

In [60]:
# we can prioritize one of the df to be merged
pd.merge(restaurants,restaurants2,left_on="Restaurant",right_on="Restaurant", how='outer' ) 
# Let's try how ='outer', how= 'left', how = 'right'

             Restaurant     Location  Score   Patent
0   HABITAT COFFEE SHOP        Milan   95.0  62728.0
1              REILLY'S  Los Angeles   91.0  73839.0
2        STREET CHURROS     New York   90.0   8888.0
3   RIO GENTLEMANS CLUB         Rome   96.0      NaN
4     LE PAIN QUOTIDIEN       Berlin   89.0      NaN
5     TRINITI ECHO PARK       Madrid   99.0      NaN
6   MARCE'S MINI MARKET    Cape Town   93.0      NaN
7                POLLEN       Ottawa   94.0      NaN
8        THE SPOT GRILL      Toronto   97.0      NaN
9           RATATOUILLE          NaN    NaN   5567.0
10        THE GENTLEMAN          NaN    NaN    555.0

![Join](join.jpg)

## Try by yourself

- Import the dataset iris as a DataFrame
- Add the columns names (sepal length, sepal width, petal length, petal width, type).
- Create a new column *ratio_length* that  contains the ratio between the sepal and petal length.
- Add  a new column  named target  with value 1  if the type is setosa and 0 otherwise.